{
  "backend/main.mo": "Motoko actor defining Product and Cart types with hardcoded product data (8 skincare items), and functions to get best sellers, retrieve products, add to cart, get cart, and clear cart per caller principal.",
  "feature_evidence.json": "JSON report mapping feature requirements to implemented files, components, and test IDs for the Cosmata skincare e-commerce site, covering header, hero, trust badges, categories, best sellers, ingredients, before/after, testimonials, blog, shop, cart, and checkout features.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend TypeScript/React files, describing their purpose and key functionality in the Cosmata application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining Cosmata brand colors (beige, gold) and design tokens for borders, shadows, and component styling.",
  "frontend/index.html": "HTML entry point for the Cosmata React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home, shop, cart, and checkout pages with a shared Layout component containing Header and Footer.",
  "frontend/src/components/BeforeAfter.tsx": "Interactive before/after image comparison component with a draggable slider control, displaying acne before and clear skin after images with labels and disclaimer.",
  "frontend/src/components/BestSellers.tsx": "Best sellers section component that fetches and displays featured products in a responsive grid with loading skeletons, using ProductCard components.",
  "frontend/src/components/BlogPreview.tsx": "Blog preview section displaying three hardcoded skincare article cards with emoji icons, titles, excerpts, and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, newsletter subscription form, quick links navigation, contact details, and social media icons. Includes a privacy policy link with app identifier encoding.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, desktop/mobile navigation, search/user/cart icons, and cart item count badge. Uses TanStack Router for navigation and fetches cart data via useGetCart hook.",
  "frontend/src/components/HeroSection.tsx": "Hero section with headline, description, CTA buttons, and hero image. Features a two-column layout promoting science-backed skincare with navigation to the shop page.",
  "frontend/src/components/IngredientHighlight.tsx": "Two-column section showcasing key skincare ingredients (Vitamin C, Kojic Acid, Niacinamide) with benefits, paired with a skin texture image. Emphasizes science-backed formulations.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component displaying product details, price, optional best-seller badge, and add-to-cart button. Uses useAddToCart mutation hook for cart functionality.",
  "frontend/src/components/ShopByCategory.tsx": "Grid of clickable category cards (Serum, Cleanser, Moisturizer, Face Wash) with images that navigate to the shop page on click.",
  "frontend/src/components/Testimonials.tsx": "Customer testimonials section displaying three reviews with 5-star ratings, customer names, and feedback text in a responsive grid layout.",
  "frontend/src/components/TrustBadges.tsx": "Three-column section displaying trust badges with icons for dermatological testing, safe ingredients, and 24/7 customer support to build credibility.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching best sellers, all products, and cart data, plus mutations for adding items to cart and clearing cart with toast notifications.",
  "frontend/src/index.css": "Global styles defining Cosmata brand colors (beige #F5EFE8, gold #C9A96E) in light/dark modes using OKLCH color space, custom fonts (Playfair Display, Inter), and slider/accessibility styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity, total price, clear cart button, and checkout navigation with empty state handling.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with shipping information form (name, email, phone, address) and order summary, showing success message after order placement.",
  "frontend/src/pages/HomePage.tsx": "Main landing page composing multiple sections: hero, trust badges, categories, best sellers, ingredients, before/after, testimonials, and blog preview.",
  "frontend/src/pages/ShopPage.tsx": "Product listing page displaying all products in a responsive grid with loading skeletons using ProductCard components.",
  "frontend/tailwind.config.js": "Tailwind configuration defining Cosmata brand colors (beige, gold), custom fonts (Playfair Display, Inter), border radius variables, and animation keyframes with typography and container query plugins.",
  "project_state.json": "Project metadata describing Cosmata as a premium skincare e-commerce site with design system specifications, image requirements, and existing feature list for women aged 18-35 in India."
}